<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="./style.scss" />
    <link rel="stylesheet" href="./func.js" />
    <title>Document</title>
</head>

<body style background="foooondo.jpg">
    <center>
        <font size="+2">
            <p>&nbsp;</p>
            <p></p>
            <h1>
                <font color="purple"> Los mejores editores HTML del 2020</font>
            </h1>
            <p>
                <font color="brown"> Los mejores editores HTML tienen muchas funciones, y veremos eso y mucho
                    m&aacute;s<br />cuando repasemos nuestra lista de favoritos, todos son
                    gratuitos y para Windows,<br />aunque Dreamweaver solo te da un periodo de
                    prueba gratis.<br />As&iacute; como utilizamos todo tipo de herramientas
                    para ayudarnos con las tareas sencillas,<br />como la correcci&oacute;n
                    ortogr&aacute;fica al escribir, un editor HTML (Lenguaje de marcado de<br />hipertexto,
                    por sus siglas en ingl&eacute;s) no es diferente y te ayuda a enmendar los
                    errores<br />que se comenten al escribir c&oacute;digo.</font>
            </p>
            <h2>&iquest;Qu&eacute; es un editor de HTML?<br /><br /></h2>
            <p>
                En retrospectiva, un editor de HTML se utiliza para escribir la base de un
                sitio web. Y<br />si bien cualquier editor de texto puede hacer este
                trabajo, no significa que tengas que<br />hacerlo sin ning&uacute;n tipo
                de ayuda. Las funciones adicionales, la comprobaci&oacute;n de<br />errores
                y un editor m&aacute;s intuitivo en general, son cosas que pueden
                facilitarte la vida<br />significativamente. Los fundamentos de los
                editores de HTML son los mismos: te<br />ayudan a escribir c&oacute;digo
                resaltando las sintaxis, insertando elementos y estructuras<br />HTML de
                uso com&uacute;n, y ofreciendo autocompletado.
            </p>
            <p>&nbsp;</p>
            <h3>&iquest;que texto utiliza el editor HTML?</h3>
            <p>
                El texto que utiliza un editor HTML tambi&eacute;n se puede traducir a
                otros lenguajes, como<br />CSS, XML o JavaScript. Pero como sabemos, no
                todas las cosas est&aacute;n hechas de la<br />misma manera. Algunos
                editores pueden ser m&aacute;s f&aacute;ciles de usar, mientras que
                otros<br />brindan mayor funcionalidad que otros.
            </p>
            <p>&nbsp;</p>
            <h3>&iquest;Cu&aacute;ndo deber&iacute;as usar un editor HTML?</h3>
            <p>
                La respuesta corta es, <strong><span class="underline--magical">&iexcl;siempre!</span></strong> Un editor de HTML
                es invaluable tanto para<br />principiantes como para desarrolladores
                m&aacute;s avanzados. Ya mencionamos las<br />caracter&iacute;sticas
                b&aacute;sicas de los editores de HTML, como el resaltado de sintaxis,
                la<br />inserci&oacute;n de elementos HTML comunes y el autocompletado.
                Todo esto asegura que<br />tu c&oacute;digo sea funcional y limpio con el
                menor esfuerzo, permitiendo que sea mucho<br />m&aacute;s f&aacute;cil
                hacer lo que mejor sabes hacer: crear c&oacute;digo.
            </p>
            <p>
                Por ejemplo, el editor te notificar&aacute; si olvidas colocar la etiqueta
                final &lt;/ en un elemento<br />de c&oacute;digo. Por lo tanto, no
                deber&iacute;as imponerte limitaciones al no utilizar ning&uacute;n tipo
                de<br />editor HTML.
            </p>
            <p>&nbsp;</p>
            <h3>&iquest;Cuantos tipos de editores existen?</h3>
            <p>
                Existen dos tipos de editores: <strong> WYSIWYG</strong> y
                <strong>editores HTML textuales.</strong> Empecemos hablando del primer
                tipo.
            </p>
            <h4>WYSIWYG</h4>
            <p>
                WYSIWYG es el acr&oacute;nimo de "<strong>What You See Is What You Get" (Lo que ves es lo que </strong><strong>obtienes).</strong><br />Estos editores proporcionan una interfaz
                de edici&oacute;n que muestra c&oacute;mo se ve el c&oacute;digo en una
                p&aacute;gina web activa.<br />El uso de editores WYSIWYG no requiere<br />ning&uacute;n
                conocimiento de HTML; por lo tanto, es mucho m&aacute;s f&aacute;cil
                comenzar para un<br />usuario sin experiencia alguna en
                programaci&oacute;n.
            </p>
            <h4>Editor HTML textual</h4>
            <p>
                Como su nombre lo indica, los editores de HTML textuales se basan en
                texto. Debes<br />tener conocimientos de HTML para utilizar este tipos de
                editores. Las funciones<br />incluyen la apertura de archivos, ya sea un
                solo archivo, un proyecto completo o<br />m&uacute;ltiples proyectos, y es
                algo disponible en todos los editores. Al utilizar un editor<br />basado
                en texto, no puedes ver una vista previa en vivo del sitio.<br />Este tipo
                de editor puede ofrecer m&aacute;s libertad y opciones personalizadas. Con
                un<br />editor textual, puedes optimizar mejor las p&aacute;ginas web para
                los motores de b&uacute;squeda.<br />Por ejemplo, es posible crear una
                p&aacute;gina web que siga las Pautas de accesibilidad del<br />contenido
                web (WCAG, por sus siglas en ingl&eacute;s), para que las personas con<br />discapacidades
                puedan ver tu p&aacute;gina web.
            </p>
            <p>&nbsp;</p>
            <h3>Lista de los mejores editores HTML en el 2020</h3>
            <p>
                Como ya hemos visto qu&eacute; es un editor HTML y cu&aacute;ndo usarlo,
                finalmente podemos<br />poner las manos en los editores reales y elegir el
                mejor editor HTML.<br />Todos tenemos gustos diferentes, y cuando se trata
                de elegir una plataforma para<br />nuestro trabajo, donde pasaremos mucho
                tiempo, es importante elegir la que mejor se adapte a nosotros.<br />Todos
                los editores tienes las mismas caracter&iacute;sticas b&aacute;sicas.
                Sin<br />embargo, algunos ofrecen m&aacute;s representaci&oacute;n visual
                que otros, m&aacute;s paquetes<br />adicionales para instalar, entre otras
                cosas.
            </p>
            <p>
                La lista de los mejores editores HTML se basa en la popularidad, las
                funciones y el<br />dise&ntilde;o:
            </p>
            <p>&nbsp;</p>
            <h2>1. Atom</h2>
            <p><img src="atom.jpeg " width="120" height="120" /></p>
            <h4>El mejor editor HTML Atom</h4>
            <p>
                Atom es un editor relativamente nuevo que sali&oacute; en el 2014 y ha
                ganado un enorme<br />impulso desde entonces. Atom es un editor de
                c&oacute;digo, gratuito y de c&oacute;digo abierto, y<br />fue
                desarrollado por el equipo de GitHub. Atom usa una licencia de software
                libre para<br />su paquete y es mantenida por la comunidad de GitHub. Su
                objetivo es ofrecer una<br />experiencia premium en el editor, y a la vez
                mantenerlo completamente gratis; adem&aacute;s<br />de flexibilidad para
                personalizar el software en s&iacute;.<br />En cuanto al eslogan, presumen
                de ser el editor de texto m&aacute;s hackeable del siglo XXI.<br />Esto
                significa que los desarrolladores pueden contribuir a editar, extender,
                cambiar y<br />compartir el c&oacute;digo fuente del programa, as&iacute;
                como crear sus propios paquetes para<br />mejorar Atom.<br />Ahora
                revisemos las caracter&iacute;sticas clave de Atom.
            </p>
            <h4>Caracter&iacute;sticas clave</h4>
            <p>
                Atom viene con 81 paquetes incorporados y puedes agregar hasta 7,500
                paquetes<br />instalables adicionales. Tambi&eacute;n puedes desarrollar
                tu propio paquete.<br />Editor de texto de c&oacute;digo abierto. El
                editor completo de Atom es un programa<br />gratuito y de c&oacute;digo
                abierto y est&aacute; disponible en GitHub.<br />Atom soporta el teletipo
                (Teletype). Esta es una caracter&iacute;stica importante si quieres<br />colaborar
                con otros desarrolladores en tiempo real.<br />Soporta m&uacute;ltiples
                paneles. Atom puede dividir la interfaz en muchas ventanas para<br />que
                puedas comparar y escribir c&oacute;digo lado a lado.
            </p>
            <h4>Dise&ntilde;o</h4>
            <p>
                Atom ofrece un dise&ntilde;o elegante con un aspecto premium.<br /><strong>&iquest;Por qu&eacute; los desarrolladores prefieren Atom?</strong><br />Es personalizable. Atom es muy f&aacute;cil de personalizar; se
                puede modificar el aspecto<br />de la interfaz y agregar otras
                caracter&iacute;sticas esenciales. Tambi&eacute;n puedes construir<br />paquetes
                y temas desde cero. O simplemente instala paquetes y temas
                prefabricados<br />por la comunidad.<br /><strong>Atom en modo desarrollador.</strong>
                --&gt;Puedes experimentar agreg&aacute;ndole caracter&iacute;sticas al<br />sistema
                central.<br /><strong>Integraci&oacute;n con Git y GitHub.&nbsp;</strong><br />Edici&oacute;n multiplataforma. Atom funciona en todos los sistemas
                operativos.
            </p>
            <p>
                Disponible para:
                <span style="text-decoration: underline"><strong>Windows, OS X y Linux (64 bits).</strong></span>
            </p>
            <p>&nbsp;</p>
            <h2>
                <strong>2. Notepad ++<br /></strong>
            </h2>
            <p><img src="notepad.png" alt="notepadd ++" width="241" height="209" /></p>
            <h4>El mejor editor HTML Notepad ++</h4>
            <p>
                Notepad ++ es un editor que fue desarrollado
                <strong>para m&aacute;quinas basadas en Windows.</strong><br />Los
                usuarios de <strong>Linux</strong> tambi&eacute;n pueden usarlo
                <strong>a trav&eacute;s de Wine.</strong> Este editor se<br />distribuye
                como software libre y su repositorio tambi&eacute;n est&aacute; disponible
                en GitHub. Al<br />igual que otros proyectos de la comunidad, admite
                plugins de terceros.<br />Notepad ++ se distingue por su simplicidad,
                adem&aacute;s es s&uacute;per liviano; incluso hay una<br />versi&oacute;n
                m&oacute;vil si la necesitas. Aqu&iacute; hay algunos puntos destacados:
            </p>
            <p>
                <br /><strong>Caracter&iacute;sticas clave</strong><br />La interfaz de
                Notepad ++ es simple, liviana y r&aacute;pida.<br />Es compatible con el
                entorno de programaci&oacute;n en varios idiomas, desde<br />ActionScript,
                CSS hasta Visual Basic.
            </p>
            <p>
                100% compatible con Windows, aunque otros sistemas operativos no son<br />compatibles
                (no hay software adicional)
            </p>
            <p>
                <strong>&iquest;Por qu&eacute; los desarrolladores prefieren Notepad
                    ++?</strong><br />Es completamente <strong>gratis</strong>.
            </p>
            <p>
                <strong>Extensible</strong>: puedes agregar plugins de la comunidad o
                crear los tuyos propios.
            </p>
            <p>
                <strong>Personalizable:</strong> los desarrolladores pueden personalizar
                las funciones y la interfaz<br />seg&uacute;n sus preferencias.
            </p>
            <p>
                <strong>Dise&ntilde;o</strong><br />La interfaz de Notepad ++ es
                minimalista, pero los desarrolladores pueden<br />personalizarla.
            </p>
            <p>
                <br /><strong>Disponible para</strong>:
                <span style="text-decoration: underline"><strong>Windows y Linux (a trav&eacute;s de Wine)</strong></span>
            </p>
</body>

</html>